Revit 2027 API
UV.DotProduct Method
The dot product of this 2-D vector and the specified 2-D vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DotProduct(
	UV source
)
Public Function DotProduct (
	source As UV
) As Double
public:
double DotProduct(
	UV^ source
)
member DotProduct :
        source : UV -> float
Parameters
source UV
The vector to multiply with this vector.
Return Value
Double
The real number equal to the dot product.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The dot product is the sum of the respective coordinates of the two vectors: Pu * Ru + Pv * Rv.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace